# LEFT JOIN with Pandas

### 렉처 중간에 예제 문제가 있습니다. 풀면서 따라와주세요!
**첨부한 쿼리는 [이곳](https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all)에서 동작합니다.**

In [10]:
import pandas as pd

# 데이터 읽기

In [11]:
orders = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Orders.csv')
orderDetails = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/OrderDetails.csv')
products = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Products.csv')
customers = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Customers.csv')
categories = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Categories.csv')
suppliers = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Suppliers.csv')
shippers = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Shippers.csv')
employees = pd.read_csv('https://raw.githubusercontent.com/dataitgirls3/Data/master/Employees.csv')

# 데이터 확인하기

In [12]:
customers.head(2)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico

In [13]:
orders.head(2)

   OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
0    10248          90           5  1996-07-04          3
1    10249          81           6  1996-07-05          1

In [14]:
orderDetails.head(2)

   OrderDetailID  OrderID  ProductID  Quantity
0              1    10248         11        12
1              2    10248         42        10

In [15]:
products.head(2)

   ProductID ProductName  SupplierID  CategoryID                Unit  Price
0          1       Chais           1           1  10 boxes x 20 bags   18.0
1          2       Chang           1           1  24 - 12 oz bottles   19.0

## 고객 별 주문수를 알려주세요.

In [16]:
'''
SELECT c.CustomerID
     , COUNT(o.OrderID) as num_orders
FROM Customers AS c
     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID
GROUP BY c.CustomerID
'''

'\nSELECT c.CustomerID\n     , COUNT(o.OrderID) as num_orders\nFROM Customers AS c\n     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID\nGROUP BY c.CustomerID\n'

* 여기에서 왜 LEFT JOIN이 필요한가? -> 주문을 하나도 하지 않은 고객이 있을 수 있기 때문이다. Orders 테이블에는 존재하지 않지만, Customers 테이블에만 있는 고객들이 있기 때문이다.
* 왜 CustomerName이 아니라 CustomerID를 사용해 GROUP BY를 해야하는가? -> 동명이인이 있을 수 있기 때문이다. 이름과 다르게, CustomerID는 한 사람에 하나만 부여되는 ID입니다. 주민등록번호라고 생각해도 좋겠네요!

In [17]:
customers_order = customers.merge(orders, how='left', on='CustomerID')

In [18]:
# 1번 고객은 Orders 테이블에 정보가 없는가보군요. -> 주문을 한 번도 안 함.
customers_order.head(2)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,OrderID,EmployeeID,OrderDate,ShipperID
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany,NaN,NaN,NaN,NaN
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico,10308.0,7.0,1996-09-18,3.0

### Q1. 1번 고객이 진짜 없는지 확인 해 볼까요?

In [19]:
# Answer
customers_order[customers_order['CustomerID'] == 1]
# or
# orders[orders['CustomerID']==1] 이렇게 확인하면 됨

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,OrderID,EmployeeID,OrderDate,ShipperID
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany,NaN,NaN,NaN,NaN

### Q2. 고객 중 동명이인이 있나요?

In [20]:
# Answer
# co_name = customers_order.groupby('CustomerName').size().reset_index()
# co_name # 이렇게 하면 커스토머이름과 주문 갯수가 나옴
# 1번 풀이 
c = customers['CustomerName'].value_counts()
c[c!=1]
# 2번풀이 
# c = customers['CustomerName'].value_counts().unique() # 요렇게 해도 됨! 
# 해보면 없다는 결론이 나온다.

Series([], Name: CustomerName, dtype: int64)

### 다시 문제로 돌아옵시다.

In [21]:
# size()와 count()의 차이
# customers_num_orders = customers_order.groupby('CustomerID')['OrderID'].size() 
# -> orderid가 null 값이 있는데, 그 값들을 포함하고 나와버림 (0값인데 그래도 줄이 있잖니~ 하면서 1로 만들어버림 흑흑) 
customers_num_orders = customers_order.groupby('CustomerID')['OrderID'].count() 
#그래서 count를 해서 찾아준다! (그러면 값을 0으로 나와줌)
# value_counts()로 해도 될까? = 해보니까 size()랑 똑같이 나옴

In [22]:
customers_num_orders.sort_values()

CustomerID
1      0
26     0
32     0
40     0
22     0
      ..
75     6
65     7
87     7
63     7
20    10
Name: OrderID, Length: 91, dtype: int64

In [23]:
customers_num_orders[customers_num_orders == 0].index

Int64Index([1, 6, 12, 22, 26, 32, 40, 42, 43, 45, 50, 53, 57, 64, 74, 78, 82], dtype='int64', name='CustomerID')

In [24]:
len(customers_num_orders[customers_num_orders == 0])

17

In [25]:
customers_num_orders[customers_num_orders == 0].count() #count해줘도 됨!

17

## 1996년 10월 동안 고객 별 주문 수를 계산하세요.

### 두 쿼리 중 어떤 쿼리가 맞는 결과를 출력할까요?

In [26]:
'''
SELECT c.CustomerID
     , COUNT(o.OrderID)
FROM Customers AS c
     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID 
                           AND o.OrderDate BETWEEN '1996-10-01' AND '1996-10-31'
GROUP BY c.CustomerID
'''
# 조건절 안의 orderdate 이게 맞는 결과!!!! 
# 1996년 10월의 커스터머 아이디를 불러와서 group by 해준 거임 (그 부분만 뽑아서 left join)

"\nSELECT c.CustomerID\n     , COUNT(o.OrderID)\nFROM Customers AS c\n     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID \n                           AND o.OrderDate BETWEEN '1996-10-01' AND '1996-10-31'\nGROUP BY c.CustomerID\n"

In [27]:
'''
SELECT c.CustomerID
     , COUNT(o.OrderID)
FROM Customers AS c
     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID 
WHERE o.OrderDate BETWEEN '1996-10-01' AND '1996-10-31'
GROUP BY c.CustomerID
'''
# where 절 안의 orderdate  ! 이렇게 해버리면 where절에서 orderdate에서 양쪽 테이블에 동시에 값이 있지 않는 (그러니까 값이 없는) 테이블은 붙여지지 않음! 그래서 사라져버림.

"\nSELECT c.CustomerID\n     , COUNT(o.OrderID)\nFROM Customers AS c\n     LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID \nWHERE o.OrderDate BETWEEN '1996-10-01' AND '1996-10-31'\nGROUP BY c.CustomerID\n"

### 10월 중 주문만 뽑기

In [28]:
orders.set_index('OrderDate') #orderdat를 index로 셋팅 
orders_october = orders.set_index('OrderDate').loc['1996-10-01':'1996-10-31',:] # 앞에는 인덱스 값, 뒤에는 칼럼 값 인데 전체 다 뽑을 거니까 : 만 했음 
orders_october.head(2)

            OrderID  CustomerID  EmployeeID  ShipperID
OrderDate
1996-10-01    10318          38           8          2
1996-10-02    10319          80           7          3

In [29]:
orders_october = orders_october.reset_index()
orders_october.head(2)

    OrderDate  OrderID  CustomerID  EmployeeID  ShipperID
0  1996-10-01    10318          38           8          2
1  1996-10-02    10319          80           7          3

### Q3. 1996년 9월 주문만 뽑아서 orders_september에 저장해보세요.

In [30]:
# Answer
o1=orders.set_index('OrderDate')
o9=o1.loc['1996-09-01':'1996-09-30',:]
orders_sep=o9.reset_index()
orders_sep.head(2)

    OrderDate  OrderID  CustomerID  EmployeeID  ShipperID
0  1996-09-02    10295          85           2          2
1  1996-09-03    10296          46           6          1

### 다시 원래 문제로 돌아와서,

In [31]:
customers_orders_october = customers.merge(orders_october, how='left', on='CustomerID')

In [32]:
customers_num_orders_october = customers_orders_october.groupby('CustomerID')['OrderID'].count()

In [33]:
cu=customers_num_orders_october.sort_values().reset_index()

### Q4. CustomerID 39번 손님은 1996년 10월 중에 2번 주문을 했네요. 확인 해볼까요?

In [34]:
# Answer 내 풀이
cu[cu['CustomerID']==39]

    CustomerID  OrderID
90          39        2

In [35]:
# 다른 풀이 
orders[orders.CustomerID == 39]

    OrderID  CustomerID  EmployeeID   OrderDate  ShipperID
75    10323          39           4  1996-10-07          1
77    10325          39           1  1996-10-09          3

In [36]:
customers_orders_october[customers_orders_october['CustomerID']==39]

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,OrderDate,OrderID,EmployeeID,ShipperID
41,39,Königlich Essen,Philip Cramer,Maubelstr. 90,Brandenburg,14776,Germany,1996-10-07,10323.0,4.0,1.0
42,39,Königlich Essen,Philip Cramer,Maubelstr. 90,Brandenburg,14776,Germany,1996-10-09,10325.0,1.0,3.0

## 고객 별 주문금액을 알려주세요.

### Step 1. 주문 별 금액 계산

In [37]:
orders_detail = orders.merge(orderDetails, how='inner', on='OrderID').merge(products, how='inner', on='ProductID')[['OrderID', 'CustomerID', 'OrderDate', 'OrderDetailID', 'Quantity', 'Price']]

In [38]:
orders_detail['total_price'] = orders_detail['Quantity'] * orders_detail['Price']

In [39]:
price_by_order = orders_detail.groupby(['OrderID', 'CustomerID', 'OrderDate'])['total_price'].sum().reset_index()

In [40]:
price_by_order.head(5)

   OrderID  CustomerID   OrderDate  total_price
0    10248          90  1996-07-04       566.00
1    10249          81  1996-07-05      2329.25
2    10250          34  1996-07-08      2267.25
3    10251          84  1996-07-08       839.50
4    10252          76  1996-07-09      4662.50

In [41]:
# 계산 결과가 의도대로 나왔는지 테스트
orders_detail[orders_detail['OrderID'] == 10248]['total_price'].sum()

566.0

### Step 2. 고객 데이터와 붙이기

In [42]:
customers_price_by_order = customers.merge(price_by_order, how='left', on='CustomerID')

In [43]:
customers_price_by_order.head(2)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,OrderID,OrderDate,total_price
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany,NaN,NaN,NaN
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico,10308.0,1996-09-18,111.0

In [44]:
customers_price_by_order['total_price'] = customers_price_by_order['total_price'].fillna(0)

In [45]:
price_by_customers = customers_price_by_order.groupby('CustomerID')['total_price'].sum()

In [46]:
p1=price_by_customers.reset_index()

### Q5. 89번 고객이 총 주문한 금액은 4416불입니다. 결과가 맞는지 확인하세요.

In [67]:
# Answer
p1[p1['CustomerID'] == 89]
# 선미님 풀이 
orders_detail[orders_detail['CustomerID'] == 89]['total_price'].sum()

4416.0

## 1996년 10월 동안 고객 별 주문 금액을 계산하세요. 10월 중 주문을 한 번도 하지 않은 고객 목록을 주세요.

### Step 1. 10월 주문 별 금액 계산

In [49]:
price_by_order_october = price_by_order.set_index('OrderDate').loc['1996-10-01':'1996-10-31',:].reset_index()

In [50]:
customers_price_by_order_october = customers.merge(price_by_order_october, how='left', on='CustomerID')
customers_price_by_order_october

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,OrderDate,OrderID,total_price
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany,NaN,NaN,NaN
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,5021,Mexico,NaN,NaN,NaN
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,5023,Mexico,NaN,NaN,NaN
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK,NaN,NaN,NaN
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden,NaN,NaN,NaN
5,6,Blauer See Delikatessen,Hanna Moos,Forsterstr. 57,Mannheim,68306,Germany,NaN,NaN,NaN
6,7,Blondel père et fils,Frédérique Citeaux,"24, place Kléber",Strasbourg,67000,France,NaN,NaN,NaN
7,8,Bólido Comidas preparadas,Martín Sommer,"C/ Araquil, 67",Madrid,28023,Spain,1996-10-10,10326.0,1227.50
8,9,Bon app',Laurence Lebihans,"12, rue des Bouchers",Marseille,13008,France,1996-10-16,10331.0,111.75
9,9,Bon app',Laurence Lebihans,"12, rue des Bouchers",Marseille,13008,France,1996-10-29,10340.0,3205.80
10,10,Bottom-Dollar Marketse,Elizabeth Lincoln,23 Tsawassen Blvd.,Tsawassen,T2F 8M4,Canada,NaN,NaN,NaN
11,11,B's Beverages,Victoria Ashworth,Fauntleroy Circus,London,EC2 5NT,UK,NaN,NaN,NaN
12,12,Cactus Comidas para llevar,Patricio Simpson,Cerrito 333,Buenos Aires,1010,Argentina,NaN,NaN,NaN
13,13,Centro comercial Moctezuma,Francisco Chang,Sierras de Granada 9993,México D.F.,5022,Mexico,NaN,NaN,NaN
14,14,Chop-suey Chinese,Yang Wang,Hauptstr. 29,Bern,3012,Switzerland,NaN,NaN,NaN
15,15,Comércio Mineiro,Pedro Afonso,"Av. dos Lusíadas, 23",São Paulo,05432-043,Brazil,NaN,NaN,NaN
16,16,Consolidated Holdings,Elizabeth Brown,Berkeley Gardens 12 Brewery,London,WX1 6LT,UK,NaN,NaN,NaN
17,17,Drachenblut Delikatessend,Sven Ottlieb,Walserweg 21,Aachen,52066,Germany,NaN,NaN,NaN
18,18,Du monde entier,Janine Labrune,"67, rue des Cinquante Otages",Nantes,44000,France,NaN,NaN,NaN
19,19,Eastern Connection,Ann Devon,35 King George,London,WX3 6FW,UK,NaN,NaN,NaN
20,20,Ernst Handel,Roland Mendel,Kirchgasse 6,Graz,8010,Austria,NaN,NaN,NaN
21,21,Familia Arquibaldo,Aria Cruz,"Rua Orós, 92",São Paulo,05442-030,Brazil,NaN,NaN,NaN
22,22,FISSA Fabrica Inter. Salchichas S.A.,Diego Roel,"C/ Moralzarzal, 86",Madrid,28034,Spain,NaN,NaN,NaN
23,23,Folies gourmandes,Martine Rancé,"184, chaussée de Tournai",Lille,59000,France,NaN,NaN,NaN
24,24,Folk och fä HB,Maria Larsson,Åkergatan 24,Bräcke,S-844 67,Sweden,1996-10-11,10327.0,2828.65
25,25,Frankenversand,Peter Franken,Berliner Platz 43,München,80805,Germany,1996-10-24,10337.0,3087.52
26,25,Frankenversand,Peter Franken,Berliner Platz 43,München,80805,Germany,1996-10-30,10342.0,2876.00
27,26,France restauration,Carine Schmitt,"54, rue Royale",Nantes,44000,France,NaN,NaN,NaN
28,27,Franchi S.p.A.,Paolo Accorti,Via Monte Bianco 34,Torino,10100,Italy,NaN,NaN,NaN
29,28,Furia Bacalhau e Frutos do Mar,Lino Rodriguez,Jardim das rosas n. 32,Lisboa,1675,Portugal,1996-10-14,10328.0,1462.00
...,...,...,...,...,...,...,...,...,...,...
67,63,QUICK-Stop,Horst Kloss,Taucherstraße 10,Cunewalde,1307,Germany,NaN,NaN,NaN
68,64,Rancho grande,Sergio Gutiérrez,Av. del Libertador 900,Buenos Aires,1010,Argentina,NaN,NaN,NaN
69,65,Rattlesnake Canyon Grocery,Paula Wilson,2817 Milton Dr.,Albuquerque,87110,USA,NaN,NaN,NaN
70,66,Reggiani Caseifici,Maurizio Moroni,Strada Provinciale 124,Reggio Emilia,42100,Italy,NaN,NaN,NaN
71,67,Ricardo Adocicados,Janete Limeira,"Av. Copacabana, 267",Rio de Janeiro,02389-890,Brazil,NaN,NaN,NaN
72,68,Richter Supermarkt,Michael Holz,Grenzacherweg 237,Genève,1203,Switzerland,NaN,NaN,NaN
73,69,Romero y tomillo,Alejandra Camino,"Gran Vía, 1",Madrid,28001,Spain,NaN,NaN,NaN
74,70,Santé Gourmet,Jonas Bergulfsen,Erling Skakkes gate 78,Stavern,4110,Norway,NaN,NaN,NaN
75,71,Save-a-lot Markets,Jose Pavarotti,187 Suffolk Ln.,Boise,83720,USA,1996-10-08,10324.0,7698.45
76,72,Seven Seas Imports,Hari Kumar,90 Wadhurst Rd.,London,OX15 4NB,UK,NaN,NaN,NaN
77,73,Simons bistro,Jytte Petersen,Vinbæltet 34,København,1734,Denmark,1996-10-29,10341.0,515.00
78,74,Spécialités du monde,Dominique Perrier,"25, rue Lauriston",Paris,75016,France,NaN,NaN,NaN
79,75,Split Rail Beer & Ale,Art Braunschweiger,P.O. Box 555,Lander,82520,USA,1996-10-15,10329.0,6025.12
80,76,Suprêmes délices,Pascale Cartrain,"Boulevard Tirou, 255",Charleroi,B-6000,Belgium,NaN,NaN,NaN
81,77,The Big Cheese,Liz Nixon,89 Jefferson Way Suite 2,Portland,97201,USA,NaN,NaN,NaN
82,78,The Cracker Box,Liu Wong,55 Grizzly Peak Rd.,Butte,59801,USA,NaN,NaN,NaN
83,79,Toms Spezialitäten,Karin Josephs,Luisenstr. 48,Münster,44087,Germany,NaN,NaN,NaN
84,80,Tortuga Restaurante,Miguel Angel Paolino,Avda. Azteca 123,México D.F.,5033,Mexico,1996-10-02,10319.0,1490.40
85,81,Tradição Hipermercados,Anabela Domingues,"Av. Inês de Castro, 414",São Paulo,05634-030,Brazil,NaN,NaN,NaN
86,82,Trail's Head Gourmet Provisioners,Helvetius Nagy,722 DaVinci Blvd.,Kirkland,98034,USA,NaN,NaN,NaN
87,83,Vaffeljernet,Palle Ibsen,Smagsløget 45,Århus,8200,Denmark,NaN,NaN,NaN
88,84,Victuailles en stock,Mary Saveley,"2, rue du Commerce",Lyon,69004,France,1996-10-21,10334.0,181.00
89,85,Vins et alcools Chevalier,Paul Henriot,59 rue de l'Abbaye,Reims,51100,France,NaN,NaN,NaN
90,86,Die Wandernde Kuh,Rita Müller,Adenauerallee 900,Stuttgart,70563,Germany,NaN,NaN,NaN
91,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland,1996-10-03,10320.0,645.00
92,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland,1996-10-18,10333.0,1192.50
93,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil,NaN,NaN,NaN
94,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA,NaN,NaN,NaN
95,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland,NaN,NaN,NaN
96,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland,NaN,NaN,NaN

### Step 2. 고객 데이터와 붙이기

In [70]:
price_by_order=customers_price_by_order_october.fillna(0)

In [106]:
# 나머지를 스스로 풀어보세요!